export const treeData = [
    {
        title: '福建师范大学',
        value: '福建师范大学',
        key: '0',
        children: [
            {
                title: '福建师范大学.旗山校区',
                value: '福建师范大学.旗山校区',
                key: '0-0',
                children: [
                    {
                        title: '福建师范大学.旗山校区.1号楼',
                        value: '0-0-0',
                        key: '0-0-0',
                        children:[
                            {
                                title:'福建师范大学.旗山校区.1号楼.会议室203',
                                value: '0-0-0-0',
                                key: '0-0-0-0',
                            },
                            {
                                title:'福建师范大学.旗山校区.1号楼.会议室204',
                                value: '0-0-0-1',
                                key: '0-0-0-1',
                            }                                                   
                        ]
                    },
                    {
                        title: '福建师范大学.旗山校区.2号楼',
                        value: '0-0-1',
                        key: '0-0-1',
                        children:[
                            {
                                title:'福建师范大学.旗山校区.2号楼.会议室203',
                                value: '0-0-1-0',
                                key: '0-0-1-0',
                            },
                            {
                                title:'福建师范大学.旗山校区2号楼.会议室204',
                                value: '0-0-1-1',
                                key: '0-0-1-1',
                            }                                                   
                        ]
                    },
                ]
            },
            {
                title: '福建师范大学.仓山校区',
                value: '0-1',
                key: '0-1',
                children: [
                    {
                        title: '福建师范大学.仓山校区.1号楼',
                        value: '0-1-0',
                        key: '0-1-0',
                        children:[
                            {
                                title:'福建师范大学.仓山校区.1号楼.会议室204',
                                value: '0-1-0-0',
                                key: '0-1-0-0',
                            },                                                
                        ]
                    },
                    {
                        title: '福建师范大学.仓山校区.2号楼',
                        value: '0-1-1',
                        key: '0-1-1',
                        children:[
                            {
                                title:'福建师范大学.仓山校区.2号楼.会议室205',
                                value: '0-1-1-0',
                                key: '0-1-1-0',
                            }, 
                            {
                                title:'福建师范大学.仓山校区.2号楼.会议室206',
                                value: '0-1-1-1',
                                key: '0-1-1-1',
                            },                                               
                        ]
                    },
                ]
            },
        ],
    },
];